In [8]:
# 数据导入
import pandas as pd
df=pd.read_csv('data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [10]:
# 数据的导出
df=df.head() 
df.to_csv('data/new.csv')

In [51]:
# json数据的导入
df=pd.read_json('data/data1.json') # 读取较简单的数据
print(type(df))
print('='*20)


import json
with open('data/test.json') as f:
    data=json.load(f)
print(data['users'])
print('='*20)


print(type(data))
print('='*20)


df=pd.DataFrame(data['users'])
df

<class 'pandas.core.frame.DataFrame'>
====================
[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]
====================
<class 'dict'>
====================

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

In [67]:
# 缺失值的处理
import numpy as np
import pandas as pd
s=pd.Series([1,2,np.nan,None,pd.NA])
df=pd.DataFrame([[1,pd.NA,2],[2,3,5],[None,4,6]])
print(s)
print('='*20)


# 查看是否是缺失值
print(s.isna()) # isna()
print('='*20)
print(s.isnull()) # isnull()
print('='*20)
print('缺失值个数：',s.isna().sum())
print('='*20)
print(df.isna()) # 与series一致
print('='*20)
print(df.isna().sum())


#

0       1
1       2
2     NaN
3    None
4    <NA>
dtype: object
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
0    False
1    False
2     True
3     True
4     True
dtype: bool
====================
缺失值个数： 3
====================
       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
====================
0    1
1    1
2    0
dtype: int64

In [76]:
# 剔除缺失值
print(s.dropna()) # 只剔除缺失值 Series
print('='*20)
print(df.dropna()) # 若有缺失值，直接删除整条数据 DataFrame
print('='*20)
print(df.dropna(how='all')) # 如果所有的值都为缺失值，删除这一行
print('='*20)
print(df.dropna(thresh=2)) # 与参数how不同，在dropna()方法中是看缺失值，而thresh是看有效值。比如thresh=2，只要有效值大于等于这个数，保留数据。相反则删除。同时参数 how 和 thresh 两者不能共存

0    1
1    2
dtype: object
====================
     0  1  2
1  2.0  3  5
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6
====================
     0     1  2
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [ ]:
# 填充缺失值
df=pd.read_csv('data/weather_withna.csv')
df.tail()
print(df.isna().sum()) # 找出缺失值总数
print('='*20)
print(df.fillna({'temp_max':25,'temp_min':16,'wind':4}).tail()) # 使用字典填充
print('='*20)
print(df.fillna(df[['wind','temp_max','temp_min']].mean()).tail()) # 使用统计值填充

date               0
precipitation    303
temp_max         303
temp_min         303
wind             303
weather          303
dtype: int64
====================
            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN      25.0      16.0   4.0     NaN
1457  2015-12-28            NaN      25.0      16.0   4.0     NaN
1458  2015-12-29            NaN      25.0      16.0   4.0     NaN
1459  2015-12-30            NaN      25.0      16.0   4.0     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain
====================
            date  precipitation   temp_max  temp_min      wind weather
1456  2015-12-27            NaN  15.851468  7.877202  3.242055     NaN
1457  2015-12-28            NaN  15.851468  7.877202  3.242055     NaN
1458  2015-12-29            NaN  15.851468  7.877202  3.242055     NaN
1459  2015-12-30            NaN  15.851468  7.877202  3.242055     NaN
1460  2015-12-31           20.6  12.200000  5.000000  3.800000    rain